---
kind: method
id: M:Autodesk.Revit.DB.AddInId.Dispose
source: html/13f4987a-0727-86f8-2f26-3d227aab47de.htm
---
# Autodesk.Revit.DB.AddInId.Dispose Method

Releases all resources used by the AddInId

## Syntax (C#)
```csharp
public void Dispose()
```